# Классы и объекты классов.

#                                *** ИНКАПСУЛЯЦИЯ* **

# И чтобы пользователь класса не мог случайно или намеренно вмешаться в его внутреннюю работу,
# данные и методы можно скрывать. То есть, к скрытым данным и методам нельзя напрямую обращаться извне,
# только внутри класса. Такой механизм в ООП называется ИНКАПСУЛЯЦИЕЙ. Благодаря инкапсуляции класс
# становится единым целым, а работа с ним возможна только через разрешенные (публичные) свойства и методы.

#                                  *** НАСЛЕДОВАНИЕ ***

#  Следующая важная идея ООП – наследование классов. Наследование позволяет как бы вынести «за скобки»
#  общее для разных классов.

#                                   *** ПОЛИМОРФИЗМ ***

# Наконец, последняя важная концепция ООП – полиморфизм. Это необычное слово, применительно к классам
# и объектам означает, что мы можем единым образом работать с разными типами данных. Вообще, в программировании
# различают два вида полиморфизма. Это, так называемый, Ad hoc полиморфизм и параметрический полиморфизм.
# Первый, Ad hoc существовал еще до появления ООП и реализовывался через перегрузку функций и приведение
# различных типов данных.
